;-----------------------------------------
;
; WindowsでMac風の操作を実現する
; 参考）http://www.karakaram.com/alt-ime-on-off
;-----------------------------------------

#Include IME.ahk

;-----------------------------------------
; Razer Synapseなど、キーカスタマイズ系のツールを併用しているときのエラー対策
;-----------------------------------------
#MaxHotkeysPerInterval 350

;-----------------------------------------
; 主要なキーを HotKey に設定し、何もせずパススルーする
;-----------------------------------------
*~a::
*~b::
*~c::
*~d::
*~e::
*~f::
*~g::
*~h::
*~i::
*~j::
*~k::
*~l::
*~m::
*~n::
*~o::
*~p::
*~q::
*~r::
*~s::
*~t::
*~u::
*~v::
*~w::
*~x::
*~y::
*~z::
*~1::
*~2::
*~3::
*~4::
*~5::
*~6::
*~7::
*~8::
*~9::
*~0::
*~F1::
*~F2::
*~F3::
*~F4::
*~F5::
*~F6::
*~F7::
*~F8::
*~F9::
*~F10::
*~F11::
*~F12::
*~`::
*~~::
*~!::
*~@::
*~#::
*~$::
*~%::
*~^::
*~&::
*~*::
*~(::
*~)::
*~-::
*~_::
*~=::
*~+::
*~[::
*~{::
*~]::
*~}::
*~\::
*~|::
*~;::
*~'::
*~"::
*~,::
*~<::
*~.::
*~>::
*~/::
*~?::
*~Esc::
*~Tab::
*~Space::
*~LAlt::
*~RAlt::
*~LCtrl::
*~RCtrl::
*~Left::
*~Right::
*~Up::
*~Down::
*~Enter::
*~PrintScreen::
*~Delete::
*~Home::
*~End::
*~PgUp::
*~PgDn::
    Return

;-----------------------------------------
; 左 Ctrl 空打ちで IME を OFF
;-----------------------------------------
LCtrl up::
    if (A_PriorHotkey == "*~LCtrl")
    {
        IME_SET(0)
    }
    Return

;-----------------------------------------
; 右 Ctrl 空打ちで IME を ON
;-----------------------------------------
RCtrl up::
    if (A_PriorHotkey == "*~RCtrl")
    {
        IME_SET(1)
    }
    Return

;-----------------------------------------
; LCtrl + Tab で Alt + Tab と同じ動きをさせる
;-----------------------------------------
<^Tab::AltTab

;-----------------------------------------
; Ctrl + Shift + z で Ctrl + y と同じ動きをさせる
;-----------------------------------------
$^+z::
    SetKeyDelay -1
    Send {RCtrl Down}y{RCtrl Up}
    Return

